app/Http/Controllers/AppointmentConfirmationController.php

        // return;
        try {
            $from = "+" . $from;
            $appointment = \App\Models\Appointment::where('mobile', $from)
                ->where(function ($query) {
                    $query->whereNull('is_confirmed')
                          ->orWhere('is_confirmed', false);
                })
                ->orderBy('created_at', 'desc')
                ->first();
---
select * from `appointments` where `mobile` = '16315551181' and (`is_confirmed` is null or `is_confirmed` = 0) order by `created_at` desc limit 1

                if ($payload === 'CONFIRM_APPOINTMENT') {
                    if ($appointment) {
                        $appointment->is_confirmed = true;
                        $appointment->save();
---
update `appointments` set `is_confirmed` = 1, `appointments`.`updated_at` = '2025-09-05 14:18:18' where `id` = 2

                if ($payload === 'RESCHEDULE_APPOINTMENT') {
                    if ($appointment) {
                        $appointment->is_confirmed = false;
                        $appointment->save();
---
update `appointments` set `is_confirmed` = 0, `appointments`.`updated_at` = '2025-09-05 14:18:52' where `id` = 1