app/Http/Controllers/SiteController.php

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = '/' limit 1
---
    public function index(){
        $pageTitle = 'Home';
        $sections = Page::where('tempname',activeTemplate())->where('slug','/')->first();

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'favicon.ico' limit 1
---
    public function pages($slug)
    {
        $page = Page::where('tempname',activeTemplate())->where('slug',$slug)->firstOrFail();